CSI API ETABS v1

# cGenDisplSetPoint Method

---

**Namespace:** ETABSv1
**Assembly:** ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (1.27.0.0)

Syntax

C#

VB

C++

F#

Copy

    int SetPoint(
    	string Name,
    	string PointName,
    	ref double[] SF
    )

    Function SetPoint (
    	Name As String,
    	PointName As String,
    	ByRef SF As Double()
    ) As Integer

    Dim instance As cGenDispl
    Dim Name As String
    Dim PointName As String
    Dim SF As Double()
    Dim returnValue As Integer

    returnValue = instance.SetPoint(Name,
    	PointName, SF)

    int SetPoint(
    	String^ Name,
    	String^ PointName,
    	array<double>^% SF
    )

    abstract SetPoint :
            Name : string *
            PointName : string *
            SF : float[] byref -> int

#### Parameters

Name

    Type: SystemString

PointName

    Type: SystemString

SF

    Type: SystemDouble

#### Return Value

Type: Int32

See Also

#### Reference

cGenDispl Interface

ETABSv1 Namespace

ETABS®, SAFE®, SAP2000® and CSiBridge® are registered trademarks of Computers
and Structures, Inc.

Copyright © Computers and Structures, Inc. 2023. All rights
reserved.

support@csiamerica.com